Mermaid some diagrams
Signed-off-by: Rick Taylor <rtaylor@aalyria.com>
